In [3]:
import numpy as np
import pandas as pd

In [7]:
data=np.arange(0,20).reshape(5,4)

In [9]:
data

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [15]:
pd.DataFrame(data)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [17]:
df=pd.DataFrame(data=np.arange(0,20).reshape(5,4),
            columns=["Age","Height","Weight","dob"],
            index=["Row1","Row2","Row3","Row4","Row5"])

In [19]:
df

      Age  Height  Weight  dob
Row1    0       1       2    3
Row2    4       5       6    7
Row3    8       9      10   11
Row4   12      13      14   15
Row5   16      17      18   19

In [21]:
df.isnull()

        Age  Height  Weight    dob
Row1  False   False   False  False
Row2  False   False   False  False
Row3  False   False   False  False
Row4  False   False   False  False
Row5  False   False   False  False

In [23]:
df.isnull().sum()

Age       0
Height    0
Weight    0
dob       0
dtype: int64

In [25]:
df

      Age  Height  Weight  dob
Row1    0       1       2    3
Row2    4       5       6    7
Row3    8       9      10   11
Row4   12      13      14   15
Row5   16      17      18   19

In [27]:
df["Weight"]

Row1     2
Row2     6
Row3    10
Row4    14
Row5    18
Name: Weight, dtype: int32

In [29]:
type(df["Weight"])

pandas.core.series.Series

In [31]:
df[["Height","dob"]]

      Height  dob
Row1       1    3
Row2       5    7
Row3       9   11
Row4      13   15
Row5      17   19

In [33]:
df.loc[["Row5","Row2"]]

      Age  Height  Weight  dob
Row5   16      17      18   19
Row2    4       5       6    7

In [35]:
df.loc["Row3"]

Age        8
Height     9
Weight    10
dob       11
Name: Row3, dtype: int32

In [37]:
df

      Age  Height  Weight  dob
Row1    0       1       2    3
Row2    4       5       6    7
Row3    8       9      10   11
Row4   12      13      14   15
Row5   16      17      18   19

In [45]:
df.iloc[2:4,1:3]

      Height  Weight
Row3       9      10
Row4      13      14

In [ ]:
pd.read_csv("")